{
    "forall": [
        {"fr":"Le Naturoll","en":"The Naturoll"},
        {"fr":"Prêt à gagner le concours robotique.","en":"Ready to win the robotic's contest."}
    ],
    
    "indexhtml": [
        {"fr":"Découvrir","en":"Discover"},
        {"fr":"NATUROLL","en":"NATUROLL"},
        {"fr":"MEMBRES","en":"MEMBERS"},
        {"fr":"APRES LE CONCOURS","en":"AFTER THE CONTEST"},
        {"fr":"Compte rendu du concours 2024 et des résultats de Naturoll","en":"2024 robotic's contest report and Naturoll's results."},
        {"fr":"Découvrez les membres de Naturoll","en":"Discover Naturoll's members"}
    ],

    "naturollhtml": [
        {"fr":"Conception","en":"Conception"},
        {"fr":"Structure mécanique du robot","en":"Mechanical structure of the robot"},
        {"fr":"Solutions techniques","en":"Technical solutions"},
        {"fr":"Électronique et programmation","en":"Electronic and Programming"},
        {"fr":"Déroulement du projet","en":"Unfolding of the project"},
        {"fr":"Étapes de conception","en":"Stages of the conception"},
        {"fr":"Difficultés rencontrées","en":"Difficulties met"},
        {"fr":"Rôles et répartitions des tâches","en":"Roles and and task distribution"},
        {"fr":"Design du robot et de sa carosserie","en":"Robot's design and it's bodywork"},
        {"fr":"Solutions techniques pour les épreuves","en":"Technical solution for the tests"},
        {"fr":"Programmation du robot","en":"Progamming the robot"},
        {"fr":"Développement du site internet","en":"Website's development"}
    ],

    "naturollChilds": [
        {"fr":"Page précédente","en":"Previous page"}
    ],

    "naturollconceptionhtml":[
        {"fr":"Conception","en":"Conception"},
        {"fr":"Structure mécanique du robot","en":"Mechanical structure of the robot"},
        {"fr":"Solutions techniques","en":"Technical solutions"},
        {"fr":"Électronique et programmation","en":"Electronics and programming"},
        {"fr":"La structure mécanique du robot est faite de bois. Elle a été découpée par une découpe laser dans du bois de 3mm.","en":"The robot's mechanical structure is made of wood. It was cut by a laser in 3mm wood."},
        {"fr":"L'attrape balle du robot est fait à partir du même bois que la carosserie. Il a été fait par Thomas.","en":"The robot's ball catcher is part of the same wood as the bodywork.  It was made by Thomas."},
        {"fr":"La programmation du robot et son électronique ont été gérés par Lucas. L'électronique du robot est très sommaire avec l'utilisation que nous en avons.","en":"The robot programme and electronics were managed by Lucas. The use of the electonics was very brief considering it's purpose."}
    ],

    "naturollderoulementhtml":[
        {"fr":"Déroulement du projet","en":"Unfolding of the project"},
        {"fr":"Page précédente","en":"Previous page"},
        {"fr":"Étapes de conception","en":"Stages of the conception"},
        {"fr":"Difficultés recontrées","en":"Difficulties met"},
        {"fr":"Le robot Naturoll a comme base le Kitronik move motor et un chassis en bois fabriqué sur mesure avec un design rappelant la nature.","en":"The base of the robot «Naturoll» is the Kitronik move:motor and a beautiful bodywork made of wood and a designe inspired by nature."},
        {"fr":"L'équipe de Naturoll a été confrontée à de nombreux problèmes lors de la conception du robot Naturoll.","en":"The «Naturoll» team has been confronted by numerous problemes while the conception stages of the robot Naturoll."},
        {"fr":"Circuit Naturoll Test Track utilisé pour les tests du suiveur de lignes","en":"The Naturoll Circuit Test Track was used for the line follower tests"}
    ],

    "deroulementDifficulte1": [
        {"fr":"La première de toutes fut lors de la programmation pour l'épreuve numéro 1. Lucas a passé du temps à essayer de corriger un problème:","en":"The first of many was during the first testt. Lucas spent some time trying to fix a probleme:"},
        {"fr":"dans l'épreuve numéro 1 où le robot doit pouvoir suivre des lignes parfaitement, lorsque Naturoll rencontrait un virage en angle droit (voir image ci dessous),","en":"The first test needs the robot to follow line perfectly, but when Naturoll met a right angle turn (see image underneath),"},
        {"fr":"soit le robot tournait correctement dans une direction mais faisait n'importe quoi dans l'autre direction, soit le robot s'arrête net.","en":"ether the robot would turn the right way, ether the robot would neatly stop."},
        {"fr":"Ce problème a été très vite corrigé par Lucas.","en":"The problem was quikly fixed by Lucas."}
    ],

    "deroulementDifficulte2": [
        {"fr":"Une autre difficulté a été liée avec la structure mécanique du robot.","en":"An other issue was linked mechanical structure of the robot."},
        {"fr":"Lors de la découpe d'une des pièces, une des pièces s'est mal imprimée et ne s'emboitait pas avec les autres.","en":"When we cut one of the pieces, one of them was incorrectly printed and wouldn't fit with the others."}
    ],

    "naturollroleshtml": [
        {"fr":"Rôles et répartitions des tâches","en":"Roles and and task distribution"},
        {"fr":"Design du robot et de sa carosserie","en":"Robot's design and it's bodywork"},
        {"fr":"Solutions techniques pour les épreuves","en":"Technical solution for the tests"},
        {"fr":"Programmation du robot","en":"Progamming the robot"},
        {"fr":"Développement du site internet","en":"Website's development"},
        {"fr":"Pour le design, Joshua est parti sur un thème Naturel et des couleurs naturelles (vert, bleu), le nom du robot, Naturoll vient d'ailleurs d'un mix entre Nature et roll pour rouler.","en":"For the design, Joshua came up with the naturel theme and the colors (green, blue), the name, Naturoll comes from the mix of natur and roll."},
        {"fr":"C'est Johusa DELAIGUE qui a designé le robot et sa carrosserie.","en":"It's Joshua DELAIGUE designed the robot and it's paintwork."},
        {"fr":"Thomas a travaillé sur l'attrape balle et sur l'arbre qui est sur le toit du robot.","en":"Thomas worked on the ball catcher and the tree on the roof of the robot."},
        {"fr":"C'est Thomas FOUET qui a trouvé les solutions techniques pour les épreuves.","en":"It's Thomas FOUET who found the technical solutions for the tests."},
        {"fr":"Le robot Naturoll est programmé en langage bloc, avec l'outil","en":"The robot Naturoll was programmed with blocs,  using the tool"},
        {"fr":"Makecode for micro:bit.","en":"Makecode for micro:bit."},
        {"fr":"Le site du robot Naturoll est développé en","en":"The website for the Naturoll robot was developped in"},
        {"fr":"HTML (corps du site) ainsi qu'en","en":"HTML (websites body) also in"},
        {"fr":"CSS (esthétique du site) et en","en":"CSS (Websites cosmetics) and in"},
        {"fr":"JavaScript (interactivité).","en":"JavaScript (interactivity)."},
        {"fr":"C'est Philéas PLATTET qui a developpé le site internet.","en":"It's Phileas PLATTET who developped the website."}
    ],

    "membreshtml": [
        {"fr":"Les membres de Naturoll","en":"The Naturoll crew"},
        {"fr":"Découvrez qui a travaillé sur le robot","en":"Discover who worked on the robot"},
        {"fr":"THOMAS","en":"THOMAS"},
        {"fr":"LUCAS","en":"LUCAS"},
        {"fr":"JOSHUA","en":"JOSHUA"},
        {"fr":"PHILÉAS","en":"PHILEAS"},
        {"fr":"En savoir plus","en":"Learn more"}
    ],

    "membresForAll": [
        {"fr":"SECRÉTAIRE","en":"SECRETARY"},
        {"fr":"INGÉNIEUR","en":"ENGENIER"},
        {"fr":"PROGRAMMEUR","en":"PROGRAMMER"},
        {"fr":"TECHNICIEN","en":"TECHNICIAN"},
        {"fr":"TRADUCTEUR","en":"TRANSLATER"},
        {"fr":"DESIGNER","en":"DESIGNER"},
        {"fr":"GESTIONNAIRE","en":"MANAGER"},
        {"fr":"CHEF DE PROJET","en":"PROJECT CHIEF"},
        {"fr":"DÉVELOPPEUR","en":"DEVELOPPER"},
        {"fr":"TROISIEME 4 - CND 22","en":"Year 10/Ninth_grade 4 -CND 22"},
        {"fr":"Cliquez sur un rôle pour en savoir plus.","en":"Click on a role to learn more."},
        {"fr":"Retour","en":"Back"}
    ],

    "knownDevLangs": [
        {"fr":"Connaît :","en":"Learn :"},
    {"fr":"Microsoft MakeCode for micro:bit est un outil permmettant le codage en bloc pour la carte BBC micro:bit","en":"Microsoft MakeCode for micro:bit is a tool to code using blocs the BBC micro:bit chip"},
        {"fr":"Le HTML 5 est un langage de programmation permettant de créer des pages web. Le HTML permet de créer la structure du site, les textes etc.","en":"HTML 5 is a markup language used to create web pages. HTML is used used to create the website's structure, texts..."},
        {"fr":"Le CSS 3 permet de rajouter du style à la page web.","en":"CSS 3 add style to the web page."},
        {"fr":"Le JavaScript permet de rajouter du dynamisme à la page web. C'est ce language qui gère les intèraction comme les boutons.","en":"JavaScript add dynamic effects to the page. It's a language the manages interactions like buttons."}
    ],

    "thomashtml": [
        {"fr":"Thomas","en":"Thomas"},
        {"fr":"Thomas est secrétaire. Le secrétaire remplit la feuille qui dit ce que fais chaque personne à chaque cours.","en":"Thomas is the secretary. He fills out the paper the says what each personne does each classe."},
        {"fr":"Thomas est ingénieur. L'ingénieur cherche les solutions techniques pour les différentes épreuves. Par exemple l'attrappe balle","en":"Thomas is the engenier. THe engenier searcges for technical solutions for different tests. For example the balle catcher"}
    ],

    "lucashtml": [
        {"fr":"Lucas","en":"Lucas"},
        {"fr":"Lucas est programmeur. Le programmeur code le robot Naturoll avec Microsoft Makecode for micro:bit qui lui permet de coder en language bloc type scratch.","en":"Lucas is the programmer. The programmer code the Naturoll robot with Microsoft Makecode for micro:bit wich lets him code using blocs like with MIT's scratch."},
        {"fr":"Lucas est technicien. Le technicien s'occupe de la partie électronique du robot.","en":"Lucas is the technician. The Technician is in charge of all thing electronics on the robot."},
        {"fr":"Lucas est traducteur. Le traducteur s'occupe de traduire les pages du site web en anglais.","en":"Lucas is the translater. The translater translates the web pages on the website in english."},
        {"fr":"DÉV. ADJOINT","en":"DEV ASSISTANT"},
        {"fr":"Lucas est développeur adjoint. Le développeur adjoint aide le développeur lors de difficultés rencontrées.","en":"Lucas is the developper's assistant. The developper's assistant is helps the main developper when he needs help."}
    ],

    "joshuahtml": [
        {"fr":"Joshua","en":"Joshua"},
        {"fr":"Joshua est designer. Le designer designe la carosserie du robot et les couleurs globales du projet.","en":"Joshua is the designer. The designer designes the robot's paintwork and the globales colors of the project."},
        {"fr":"Joshua est gestionnaire. Le gestionnaire gère le budget de l'équipe et passe les commandes de matériaux nécésaires.","en":"Joshua is administrator. The admin manages the budget of the team and orders the necessary materiels."}
    ],

    "phileashtml": [
        {"fr":"Philéas","en":"Phileas"},
        {"fr":"Philéas est le chef de projet. C'est lui qui gère l'équipe en général.","en":"Phileas is the project manager. It's him who manages the team."},
        {"fr":"Philéas est développeur informatique. C'est lui qui est en charge du développement du site internet.","en":"Phileas is the developpeur. He is in charge of developpes the site."},
        {"fr":"PROGRAMMEUR ADJ.","en":"PROG. ASSISTANT"},
        {"fr":"Philéas est programmeur adjoint. C'est lui qui aide le programmeur en cas de difficultés.","en":"Phileas is the programmer's assistant. He helps the programmers when he encounters a difficulty."}
    ],

    "listofpageshtml": [
        {"fr":"Toutes les pages du site","en":"Every web pages"},
        {"fr":"Ici sont recensées toutes les pages du site, au cas où vous en chercheriez une en particulier !","en":"Here are listed all the webpages of the site, in case you're looking for one in particular!"},
        {"fr":"Accueil","en":"Home page"},
        {"fr":"Naturoll","en":"Naturoll"},
        {"fr":"Membres","en":"Members"},
        {"fr":"Autres","en":"Other"},
        {"fr":"Conception","en":"Conception"},
        {"fr":"Déroulement","en":"Project's unfolding"},
        {"fr":"Thomas","en":"Thomas"},
        {"fr":"Lucas","en":"Lucas"},
        {"fr":"Joshua","en":"Joshua"},
        {"fr":"Philéas","en":"Phileas"},
        {"fr":"Toutes les pages du site","en":"Every pages of the site"}
    ]
}
